[Download Dataset](https://www.kaggle.com/kaggle/sf-salaries)

In [31]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('Salaries.csv')

C:\Users\DIVYA\AppData\Local\Temp\ipykernel_2620\2928864109.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  data = pd.read_csv('Salaries.csv')

### 1.Display Top 10 Rows of The Dataset

In [4]:
data.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

### 2. Check Last 10 Rows of The Dataset

In [5]:
data.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

### 3. Find Shape of Our Dataset (Number of Rows And Number of Columns)

In [6]:
data.shape

(148654, 13)

In [7]:
# data contain 148654 rows and 13 columns

### 4. Getting Information About Our Dataset Like Total Number Rows, 
### Total Number of Columns, Datatypes of Each Column And Memory Requirement

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

### 5.Check Null Values In The Dataset

In [10]:
data.isnull().sum()/len(data)

Id                  0.000000
EmployeeName        0.000000
JobTitle            0.000000
BasePay             0.004070
OvertimePay         0.000000
OtherPay            0.000000
Benefits            0.243243
TotalPay            0.000000
TotalPayBenefits    0.000000
Year                0.000000
Notes               1.000000
Agency              0.000000
Status              0.743572
dtype: float64

### 6. Drop ID, Notes, Agency and Status Columns

In [13]:
data.drop(["Id", "Notes", "Agency", "Status"], axis= 1, inplace= True)

In [14]:
data

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011
...,...,...,...,...,...,...,...,...,...
148649,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014
148650,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014
148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014
148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014
148653,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014

### 7. Get Overall Statistics About The Dataframe

In [16]:
data.describe()

            TotalPay  TotalPayBenefits           Year
count  148654.000000     148654.000000  148654.000000
mean    74768.321972      93692.554811    2012.522643
std     50517.005274      62793.533483       1.117538
min      -618.130000       -618.130000    2011.000000
25%     36168.995000      44065.650000    2012.000000
50%     71426.610000      92404.090000    2013.000000
75%    105839.135000     132876.450000    2014.000000
max    567595.430000     567595.430000    2014.000000

In [20]:
data.describe(include= "object")

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits
count,148654,148654,148049.0,148654.0,148654.0,112495.0
unique,110811,2159,109900.0,66555.0,84968.0,99635.0
top,Kevin Lee,Transit Operator,0.0,0.0,0.0,0.0
freq,13,7036,875.0,66103.0,35218.0,1053.0

### 8. Find Occurrence of The Employee Names  (Top 5)

In [22]:
data["EmployeeName"].value_counts().head(5)

Kevin Lee       13
Richard Lee     11
Steven Lee      11
William Wong    11
Stanley Lee      9
Name: EmployeeName, dtype: int64

### 9. Find The Number of Unique Job Titles

In [23]:
data["JobTitle"].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

### 10. Total Number of Job Titles Contain Captain

In [26]:
data[data["JobTitle"].str.contains("Captain")]["JobTitle"].count()

411

### 11. Display All the Employee Names From Fire Department

In [27]:
data[data["JobTitle"].str.contains("Fire Department")]["EmployeeName"]

36162       Joanne Hayes-White
72926     Joanne M Hayes-White
102303          Robert E Evans
110535    Joanne M Hayes-White
Name: EmployeeName, dtype: object

### 12.  Replace 'Not Provided' in EmployeeName' Column to NaN

In [30]:
data["BasePay"].unique()

array([167411.18, 155966.02, 212739.13, ..., '6.04', '15.50',
       'Not Provided'], dtype=object)

In [34]:
data["BasePay"]=data["BasePay"].replace('Not Provided', np.nan)

In [36]:
data.isnull().sum()/len(data)*100

EmployeeName         0.000000
JobTitle             0.000000
BasePay              0.409676
OvertimePay          0.000000
OtherPay             0.000000
Benefits            24.324270
TotalPay             0.000000
TotalPayBenefits     0.000000
Year                 0.000000
dtype: float64

In [38]:
data.dropna(subset= "BasePay", inplace = True)

In [39]:
data.isnull().sum()/len(data)*100

EmployeeName         0.00000
JobTitle             0.00000
BasePay              0.00000
OvertimePay          0.00000
OtherPay             0.00000
Benefits            24.42433
TotalPay             0.00000
TotalPayBenefits     0.00000
Year                 0.00000
dtype: float64

In [41]:
data["BasePay"]=data["BasePay"].astype('float')

### 13.Find Minimum, Maximum and Average BasePay

In [45]:
print("Maximum BasePay", data["BasePay"].max())
print("Minimum BasePay", data["BasePay"].min())
print("Average BasePay", data["BasePay"].mean())

Maximum BasePay 319275.01
Minimum BasePay -166.01
Average BasePay 66325.44884050643

### 14. Drop The Rows Having 5 Missing Values

In [46]:
data.isnull().sum()/len(data)*100

EmployeeName         0.00000
JobTitle             0.00000
BasePay              0.00000
OvertimePay          0.00000
OtherPay             0.00000
Benefits            24.42433
TotalPay             0.00000
TotalPayBenefits     0.00000
Year                 0.00000
dtype: float64

### 15. Find Job Title of ALBERT PARDINI

In [52]:
Jobtitile=data[data["EmployeeName"]== "ALBERT PARDINI"]["JobTitle"][2]
Jobtitile

'CAPTAIN III (POLICE DEPARTMENT)'

In [53]:
print(print("Job Title of Albert Pardini is",  Jobtitile))

Job Title of Albert Pardini is CAPTAIN III (POLICE DEPARTMENT)
None

### 16. How Much ALBERT PARDINI Make (Include Benefits) ?

In [55]:
data[data["EmployeeName"]=="ALBERT PARDINI"]["TotalPayBenefits"][2]

335279.91

### 17. Display Name of The Person Having The Highest BasePay

In [59]:
data[data["BasePay"]==data["BasePay"].max()]["EmployeeName"][72925]

'Gregory P Suhr'

### 18. Find Average BasePay of All Employee Per Year

In [61]:
data.groupby("Year")["BasePay"].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

### 19. Find Average BasePay of All Employee Per JobTitle

In [66]:
a= data.groupby("JobTitle")["BasePay"]
a.mean()

JobTitle
ACCOUNT CLERK                                     43300.806506
ACCOUNTANT                                        46643.172000
ACCOUNTANT INTERN                                 28732.663958
ACPO,JuvP, Juv Prob (SFERS)                       62290.780000
ACUPUNCTURIST                                     66374.400000
                                                      ...
X-RAY LABORATORY AIDE                             47664.773077
X-Ray Laboratory Aide                             46086.387100
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS    52609.910000
Youth Comm Advisor                                39077.957500
ZOO CURATOR                                       43148.000000
Name: BasePay, Length: 2154, dtype: float64

### 20. Find Average BasePay of Employee Having Job Title ACCOUNTANT

In [67]:
a.get_group("ACCOUNTANT").mean()

46643.172

### 21. Find Top 5 Most Common Jobs

In [69]:
data["JobTitle"].value_counts().head(5)

Transit Operator                6975
Special Nurse                   4382
Registered Nurse                3725
Public Svc Aide-Public Works    2514
Police Officer 3                2411
Name: JobTitle, dtype: int64